def area(a, b, c):
    """
    Функция для вычисления полупериметра треугольника.

    Аргументы:
    a -- длина первой стороны треугольника
    b -- длина второй стороны треугольника
    c -- длина третьей стороны треугольника

    Возвращает:
    Полупериметр треугольника, вычисленный по формуле: (a + b + c) / 2
    """
    return (a + b + c) / 2  # Возвращаем полупериметр треугольника

def perimeter(a, b, c):
    """
    Функция для вычисления периметра треугольника.

    Аргументы:
    a -- длина первой стороны треугольника
    b -- длина второй стороны треугольника
    c -- длина третьей стороны треугольника

    Возвращает:
    Периметр треугольника, вычисленный по формуле: a + b + c
    """
    return a + b + c  # Возвращаем периметр треугольника
